{
  "add_cross_attention": false,
  "architectures": [
    "ElectraForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 768,
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "unknown",
    "1": "go_hearbe",
    "2": "search_products",
    "3": "click_order_history",
    "4": "click_cart",
    "5": "click_login",
    "6": "click_logout",
    "7": "read_current_page_actions",
    "8": "read_search_results",
    "9": "select_search_result",
    "10": "read_product_info",
    "11": "update_product_option",
    "12": "click_add_to_cart",
    "13": "click_buy_now",
    "14": "read_reviews",
    "15": "click_wishlist",
    "16": "read_cart_items",
    "17": "select_cart_item",
    "18": "unselect_cart_item",
    "19": "adjust_item_quantity",
    "20": "read_order_amount",
    "21": "read_payment_order_info",
    "22": "submit_payment",
    "23": "read_order_detail",
    "24": "click_track_delivery",
    "25": "request_exchange_return",
    "26": "delete_order_history",
    "27": "read_option_info"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "adjust_item_quantity": 19,
    "click_add_to_cart": 12,
    "click_buy_now": 13,
    "click_cart": 4,
    "click_login": 5,
    "click_logout": 6,
    "click_order_history": 3,
    "click_track_delivery": 24,
    "click_wishlist": 15,
    "delete_order_history": 26,
    "go_hearbe": 1,
    "read_cart_items": 16,
    "read_current_page_actions": 7,
    "read_option_info": 27,
    "read_order_amount": 20,
    "read_order_detail": 23,
    "read_payment_order_info": 21,
    "read_product_info": 10,
    "read_reviews": 14,
    "read_search_results": 8,
    "request_exchange_return": 25,
    "search_products": 2,
    "select_cart_item": 17,
    "select_search_result": 9,
    "submit_payment": 22,
    "unknown": 0,
    "unselect_cart_item": 18,
    "update_product_option": 11
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.1.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 35000
}
