{
  "add_cross_attention": false,
  "architectures": [
    "ElectraForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 768,
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "unknown",
    "1": "go_hearbe",
    "2": "go_coupang",
    "3": "read_current_page_actions",
    "4": "read_hearbe_guide",
    "5": "go_mall",
    "6": "click_shared_shopping_entry",
    "7": "click_app_download",
    "8": "input_id",
    "9": "input_password",
    "10": "check_keep_login",
    "11": "uncheck_keep_login",
    "12": "click_login",
    "13": "click_find_id",
    "14": "click_find_password",
    "15": "click_signup",
    "16": "click_check_id_duplicate",
    "17": "input_name",
    "18": "click_view_terms",
    "19": "read_terms",
    "20": "check_terms_agreement",
    "21": "submit_signup",
    "22": "input_phone_number",
    "23": "input_password_confirm",
    "24": "input_email",
    "25": "read_available_marketplaces",
    "26": "click_logout",
    "27": "click_go_coupang",
    "28": "click_cart",
    "29": "click_my_page",
    "30": "read_page",
    "31": "click_change_password",
    "32": "click_delete_account",
    "33": "click_order_detail",
    "34": "click_product_view",
    "35": "go_order_history",
    "36": "read_order_history_recent",
    "37": "read_frequent_products",
    "38": "read_recommended_products"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "check_keep_login": 10,
    "check_terms_agreement": 20,
    "click_app_download": 7,
    "click_cart": 28,
    "click_change_password": 31,
    "click_check_id_duplicate": 16,
    "click_delete_account": 32,
    "click_find_id": 13,
    "click_find_password": 14,
    "click_go_coupang": 27,
    "click_login": 12,
    "click_logout": 26,
    "click_my_page": 29,
    "click_order_detail": 33,
    "click_product_view": 34,
    "click_shared_shopping_entry": 6,
    "click_signup": 15,
    "click_view_terms": 18,
    "go_coupang": 2,
    "go_hearbe": 1,
    "go_mall": 5,
    "go_order_history": 35,
    "input_email": 24,
    "input_id": 8,
    "input_name": 17,
    "input_password": 9,
    "input_password_confirm": 23,
    "input_phone_number": 22,
    "read_available_marketplaces": 25,
    "read_current_page_actions": 3,
    "read_frequent_products": 37,
    "read_hearbe_guide": 4,
    "read_order_history_recent": 36,
    "read_page": 30,
    "read_recommended_products": 38,
    "read_terms": 19,
    "submit_signup": 21,
    "uncheck_keep_login": 11,
    "unknown": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.1.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 35000
}
